import math

#First______________________________________________________________
'''Пользователь вводит два числа (возможно дробные).
   Вывести результат их сложения, вычитания, умножения, деления, возведения в степень, деления по модулю, целочисленного деления.
'''
print("Enter the first number")
a = float(input())
print("Enter the second number")
b = float((input()))

print("\nResults:")
print("{} + {} = {}".format(a, b, a+b))
print("{} - {} = {}".format(a, b, a-b))
print("{} * {} = {}".format(a, b, a*b))
if (b != 0): 
    print("{} / {} = {}".format(a, b, a/b))
else: 
    print(":((")
print("{} ** {} = {}".format(a, b, a**b))
if (b != 0): 
    print("{} % {} = {}".format(a, b, a%b))
else: 
    print(":((")
if (b != 0):
    print("{} // {} = {}".format(a, b, a//b))
else: 
    print(":((")

#Second___________________________________________________________________
'''Пользователь вводит своё имя, поздороваться с ним по имени.
'''
print("{}{}{}".format("Hello, ", input("\nEnter your name: "), "!"))

#Third_________________________________________________________________________
'''Вводится строка. Вывести последние два символа этой строки в обратном порядке. 
   Пример: Ввод: “ДОМ”; Вывод: “МО”. Решить не более, чем в две строки.
'''
print("{}{}".format("Reversed: ", input("\nEnter your string: ")[-1:-3:-1]))

#Fourth________________________________________________________________
'''Вводится радиус круга. Вычислить его площадь.
'''
r = float(input("\nEnter radius: "))
if (r <= 0):
    print("???")
else: 
    print("{}{}".format("Area: ", (r**2)*math.pi))